yuvadm/tiva-c/boards/ek-tm4c1294xl/usb_dev_cserial/usb_dev_cserial.c
    //
    // Loop through the characters and print them to both echo ports.
    //
    for(ui32Index = 5; ui32Index < CMD_BUF_SIZE; ui32Index++)
    {
        //
        // If a null is found then go to the next argument and replace the
        // null with a space character.
        //
        if(pucStr[ui32Index] == 0)
        {
            break;
        }

        //
        // Write out the character to both echo ports.
        //
        USBBufferWrite((tUSBBuffer *)&g_psTxBuffer[0],
                       (uint8_t *)&pucStr[ui32Index], 1);
        UARTCharPut(UART0_BASE, pucStr[ui32Index]);
    }
    return(0);
}

//****************************************************************************
//
// This function implements the "help" command.  It prints a simple list of
// the available commands with a brief description.
//
//****************************************************************************
int
Cmd_help(int argc, char *argv[])
{
    tCmdLineEntry *pEntry;

    //
    // Print some header text.
    //
    CommandPrint("\nAvailable commands\n");
    CommandPrint("------------------\n");

    //
    // Point at the beginning of the command table.
    //
    pEntry = &g_psCmdTable[0];

    //
    // Enter a loop to read each entry from the command table.  The end of the
    // table has been reached when the command name is NULL.
    //
    while(pEntry->pcCmd)
    {
        //
        // Print the command name and the brief description.
        //
        CommandPrint(pEntry->pcCmd);
        CommandPrint(pEntry->pcHelp);
        CommandPrint("\n");

        //
        // Advance to the next entry in the table.
        //
        pEntry++;
    }

    //
    // Return success.
    //
    return(0);
}

//****************************************************************************
//
// This is the table that holds the command names, implementing functions, and
// brief description.
//
//****************************************************************************
tCmdLineEntry g_psCmdTable[] =
{
    { "help",  Cmd_help,      " : Display list of commands" },
    { "h",     Cmd_help,   "    : alias for help" },
    { "?",     Cmd_help,   "    : alias for help" },
    { "echo",  Cmd_echo,      " : Text will be displayed on all echo ports" },
    { "led",   Cmd_led,      "  : Turn on/off/toggle the Status LED" },
    { 0, 0, 0 }
};

//****************************************************************************
//
// This is the main application entry function.
//
//****************************************************************************
int
main(void)
{
    uint32_t ui32TxCount;
    uint32_t ui32RxCount;
    int32_t i32Status;

    //
    // Run from the PLL at 120 MHz.
    //
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_480), 120000000);

    //
    // Not configured initially.
    //
    g_bUSBConfigured = false;


    //
    // Enable the peripherals used in this example.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_USB0);

    //
    // Configure the device pins.
    //
    PinoutSet(false, true);

    //
    // Turn off the LED.
    //
    LEDOff();

    //
    // Set the default UART configuration.
    //
    UARTConfigSetExpClk(UART0_BASE, g_ui32SysClock, DEFAULT_BIT_RATE,
                        DEFAULT_UART_CONFIG);
    UARTFIFOLevelSet(UART0_BASE, UART_FIFO_TX4_8, UART_FIFO_RX4_8);

    //
    // Configure and enable UART interrupts.
    //
    UARTIntClear(UART0_BASE, UARTIntStatus(UART0_BASE, false));
    UARTIntEnable(UART0_BASE, (UART_INT_OE | UART_INT_BE | UART_INT_PE |
                  UART_INT_FE | UART_INT_RT | UART_INT_TX | UART_INT_RX));

    //
    // Enable the system tick.
    //
    SysTickPeriodSet(g_ui32SysClock / SYSTICKS_PER_SECOND);
    SysTickIntEnable();
    SysTickEnable();

    //
    // Initialize the transmit and receive buffers for first serial device.
    //
    USBBufferInit(&g_psTxBuffer[0]);
    USBBufferInit(&g_psRxBuffer[0]);

    //
    // Initialize the first serial port instances that is part of this
    // composite device.
    //
    g_sCompDevice.psDevices[0].pvInstance =
        USBDCDCCompositeInit(0, &g_psCDCDevice[0], &g_psCompEntries[0]);

    //
    // Initialize the transmit and receive buffers for second serial device.
    //
    USBBufferInit(&g_psTxBuffer[1]);
    USBBufferInit(&g_psRxBuffer[1]);

    //
    // Initialize the second serial port instances that is part of this
    // composite device.
    //
    g_sCompDevice.psDevices[1].pvInstance =
        USBDCDCCompositeInit(0, &g_psCDCDevice[1], &g_psCompEntries[1]);

    //
    // Pass the device information to the USB library and place the device
    // on the bus.
    //
    USBDCompositeInit(0, &g_sCompDevice, DESCRIPTOR_DATA_SIZE,
                      g_pucDescriptorData);

    //
    // Clear our local byte counters.
    //
    ui32RxCount = 0;
    ui32TxCount = 0;

    //
    // Set the command index to 0 to start out.
    //
    ui32CmdIdx = 0;

    //
    // Enable interrupts now that the application is ready to start.
    //
    IntEnable(INT_UART0);

    //
    // Main application loop.
    //
    while(1)
    {
        if(g_ui32Flags & COMMAND_RECEIVED)
        {
            //
            // Clear the flag
            //
            g_ui32Flags &= ~COMMAND_RECEIVED;

            //
            // Check if this is the "echo" command, "echo" in hex is 0x6f686365
            // this prevents a more complicated string compare.
            //
            if(0x6f686365 == *((uint32_t *)(g_pcCmdBuf)))
            {
                //
                // Print out the string.
                //
                i32Status = Echo(g_pcCmdBuf);
            }
            else
            {
                //
                // Process the command line.
                //
                i32Status = CmdLineProcess(g_pcCmdBuf);
            }

            //
            // Handle the case of bad command.
            //
            if(i32Status == CMDLINE_BAD_CMD)
            {
                CommandPrint(g_pcCmdBuf);
                CommandPrint(" is not a valid command!\n");
            }
            CommandPrint("\n> ");
        }

        //
        // Have we been asked to update the status display?
        //
        if(g_ui32Flags & COMMAND_STATUS_UPDATE)
        {
            //
            // Clear the command flag
            //
            IntMasterDisable();
            g_ui32Flags &= ~COMMAND_STATUS_UPDATE;
            IntMasterEnable();
        }

        //
        // Has there been any transmit traffic since we last checked?
        //
        if(ui32TxCount != g_ui32UARTTxCount)
        {
            //
            // Take a snapshot of the latest transmit count.
            //
            ui32TxCount = g_ui32UARTTxCount;
        }

        //
        // Has there been any receive traffic since we last checked?
        //
        if(ui32RxCount != g_ui32UARTRxCount)
        {
            //
            // Take a snapshot of the latest receive count.
            //
            ui32RxCount = g_ui32UARTRxCount;

        }
    }
}
